<?php

// 1. Выведите числа от 0 до 9
// # Момент видео "5.2 Циклы" - 05:40
// # Т.к. заранее известно сколько итераций нужно, то нам подойдет цикл for


// 2. Выведите 10 случайных чисел от 1 до 10
// # то же самое, что и предыдущее задание, только выводите не счетчик


// 3. Создайте массив $items из 10 случайных целых значений от 0 до 9
// # Т.к. заранее известно элементов нужно создать, то нам подойдет цикл for
$items = [];


// 4. Добавляйте случайные целые числа от 1 до 9 в массив $numbers до тех пор, пока сумма всех элементов этого массива меньше 100
// А затем выведите сколько числе всего в массиве: "Длинна массива numbers = {}"
// # Момент видео "5.2 Циклы" - 00:05
// # Уже условие задания нам подсказывает, что нужно применить цикл while
// # Для подсчета суммы элементов массива, есть встроенная функция array_sum()
// # Чтобы узнать длину массива, есть встроенная функция count()


// 5. Переберите массив $numbers, созданный ранее, и посчитайте сумму всех четных чисел в нем
// Выведите следующие строки (как всегда вместо {} подставив нужные значения):
// Общая сумма массива numbers = {}
// Из нее часть, которая приходится на четные числа = {}
// И часть из нечетных чисел = {}
// # для перебора массивов используйте цикл foreach
// # Момент видео "5.2 Циклы" - 11:11
